<a href="https://colab.research.google.com/github/julioclerio/database_modeling_and_normalization/blob/main/part_3/3_intersecoes_alteracoes_remocoes_objetos_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

MODELO CONCEITUAL E LOGICO

<img src="https://raw.githubusercontent.com/julioclerio/database_modeling_and_normalization/96c870ad748c91062cee9495385c7318450cecc9/part_3/DER_conceptual_model.png" width="330" alt="Modelo Conceitual">


<img src="https://raw.githubusercontent.com/julioclerio/database_modeling_and_normalization/8455cec3be7f3adefb626e6e718b6cc44fc40547/part_3/DER_logical_model.png" width="340" alt="Modelo Lógico">

In [ ]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.2 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [ ]:
# IMPORTAÇÃO BIBLIOTECA
import pymysql
import pandas as pd

In [ ]:
# CRIAR CONEXÃO AO MYSQL - AWS

try:
  conexao = pymysql.connect( user= '',
                             host= '',
                             port= ,
                             password= '',
                             database= '')
except pymysql.Error as e:
  print('Erro ao se conectar: ', e)

In [39]:
# CRIAR CONEXÃO AO MYSQL - AWS

try:
    conexao = pymysql.connect(user = 'clerio_fernandes',
                             host = 'ada-santander-1007.clzgkgrmzmzh.us-east-1.rds.amazonaws.com',
                             port = 3306,
                             password = '123456',
                             database = 'clerio_fernandes_biblioteca' )

except pymysql.Error as e:
    print('Erro ao se conectar: ', e)

In [35]:
# CRIANDO UM DATABASE PARA SOLUÇÃO DO EXERCICIO
novo_banco = 'avaliacao_part3'

In [40]:
# CRIAR O CURSOR
cursor = conexao.cursor()

In [37]:
criar_database = f" CREATE DATABASE {novo_banco}"

try:
    # Executar a consulta SQL para criar o banco de dados
    cursor.execute(criar_database)
    print(f"Banco de dados '{novo_banco}' criado com sucesso.")
except Exception as e:
    print(f"Erro ao criar o banco de dados: {str(e)}")

Erro ao criar o banco de dados: (1044, "Access denied for user 'clerio_fernandes'@'%' to database 'avaliacao_part3'")

In [ ]:
# SELECIONAR O BANCO DE DADOS CRIADO
selecionado_database = f"USE {novo_banco}"

try:
    cursor.execute(selecionado_database)
    print(f"Banco de dados '{novo_banco}' selecionado com sucesso.")


except Exception as e:
    print(f"Erro ao selecionar o banco de dados: {str(e)}")

In [41]:
# COMANDO DDL CRIAR TABELA ALUNO
ddl_aluno = """CREATE TABLE aluno (
 nome_aluno VARCHAR(255) NOT NULL,
 id_aluno INT PRIMARY KEY AUTO_INCREMENT,
 aluno_alocado BOOLEAN,
 id_turma INT,
 ADD FOREIGN KEY (id_turma) REFERENCES turma(id_turma)
 UNIQUE (nome_aluno)
)"""
cursor.execute(ddl_aluno)

0

In [59]:
# COMANDO DDL CRIAR TABELA TURMA
ddl_turma = """CREATE TABLE turma (
 nome_turma VARCHAR(255),
 id_turma INT PRIMARY KEY AUTO_INCREMENT,
 codigo_turma VARCHAR(255) NOT NULL,
 id_turma INT NOT NULL,
 FOREIGN KEY (id_turma) REFERENCES turma(id_turma)
)"""
cursor.execute(ddl_turma)

0

In [ ]:
# COMANDO DDL CRIAR TABELA DISCIPLINA
ddl_disciplina = """CREATE TABLE disciplina(
 id_disciplina INT PRIMARY KEY AUTO_INCREMENT,
 nome_disciplina VARCHAR(255) NOT NULL,
 UNIQUE (nome_disciplina)
)"""
cursor.execute(ddl_disciplina)

In [ ]:
# COMANDO DDL CRIAR TABELA PROFESSOR
ddl_professor = """CREATE TABLE professor (
 nome_professor VARCHAR(255) NOT NULL,
 id_professor INT PRIMARY KEY AUTO_INCREMENT,
 id_disciplina INT,
 UNIQUE (nome_professor)
)"""
cursor.execute(ddl_professor)

In [62]:
# COMANDO DDL CRIAR TABELA ALUNO TURMA
ddl_aluno_turma = """CREATE TABLE aluno_turma (
    id_aluno INTEGER REFERENCES aluno(id_aluno),
    id_turma INTEGER REFERENCES turma(id_turma),
    PRIMARY KEY (id_aluno, id_turma)
)"""
cursor.execute(ddl_aluno_turma)

0

In [ ]:
# COMANDO DDL CRIAR TABELA PROFESSOR DISCIPLINA
ddl_professor_disciplina = """CREATE TABLE professor_disciplina (
    id_disciplina INTEGER REFERENCES disciplina(id_disciplina),
    id_professor INTEGER REFERENCES professor(id_professor),
    PRIMARY KEY (id_disciplina, id_professor)
)"""
cursor.execute(ddl_professor_disciplina)

In [64]:
# COMANDO DDL CRIAR TABELA TURMA PROFESSOR
ddl_turma_professor = """CREATE TABLE turma_professor (
    id_turma INTEGER REFERENCES turma(id_turma),
    id_professor INTEGER REFERENCES professor(id_professor),
    PRIMARY KEY (id_turma, id_professor)
)"""
cursor.execute(ddl_turma_professor)

0

In [65]:
foreign_keys = """ ALTER TABLE professor ADD FOREIGN KEY(id_disciplina) REFERENCES disciplina (id_disciplina);
ALTER TABLE aluno_turma ADD FOREIGN KEY(id_aluno) REFERENCES aluno (id_aluno);
ALTER TABLE aluno_turma ADD FOREIGN KEY(id_turma) REFERENCES turma (id_turma);
ALTER TABLE professor_disciplina ADD FOREIGN KEY(id_disciplina) REFERENCES disciplina (id_disciplina);
ALTER TABLE professor_disciplina ADD FOREIGN KEY(id_professor) REFERENCES professor (id_professor);
ALTER TABLE turma_professor ADD FOREIGN KEY(id_turma) REFERENCES turma (id_turma);
ALTER TABLE turma_professor ADD FOREIGN KEY(id_professor) REFERENCES professor (id_professor) """


# Dividindo as consultas SQL e executando uma por uma
try:
    queries = foreign_keys.split(';')
    for query in queries:
        if query.strip():  # Ignora consultas em branco
            cursor.execute(query)
    print("Chaves estrangeiras adicionadas com sucesso.")
except Exception as e:
    print(f"Erro ao adicionar chaves estrangeiras: {str(e)}")

Chaves estrangeiras adicionadas com sucesso.

a) Inserir pelo menos duas turmas diferentes na tabela de turma;

In [ ]:
nome_turma1 = "7 ANO"
codigo_turma1 = "T704"
sql_insert_turma1 = "INSERT INTO turma (nome_turma, codigo_turma) VALUES (%s, %s)"
cursor.execute(sql_insert_turma1, (nome_turma1, codigo_turma1))

nome_turma2 = "8 ANO"
codigo_turma2 = "T801"
sql_insert_turma2 = "INSERT INTO turma (nome_turma, codigo_turma) VALUES (%s, %s)"
cursor.execute(sql_insert_turma2, (nome_turma2, codigo_turma2))

conexao.commit()

In [ ]:
# INSERINDO POR INPUT
nome_turma = input("Digite o nome da turma: ")
codigo_turma = input("Digite o codigo da turma: ")
sql_insert_turma1 = "INSERT INTO turma (nome_turma, codigo_turma) values (%s, %s)"
cursor.execute(sql_insert_turma1, (nome_turma, codigo_turma))

conexao.commit()
print('\n ------------ TURMA CADASTRADA COM SUCESSO ------------------------')

# MOSTRAR A CATEGORIA ADICIONADA
df_turma = pd.read_sql_query('select * from turma', conexao)
print(df_turma.to_markdown(index = False))

b) Inserir pelo menos 1 aluno alocado em cada uma destas turmas na tabela aluno (todos com NULL na coluna aluno_alocado)

In [ ]:
nome_aluno1 = "Pedro"
id_turma1 = 1
sql_insert_aluno1 = "INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma) VALUES (%s, NULL, %s)"
cursor.execute(sql_insert_aluno1, (nome_aluno1, id_turma1))

nome_aluno2 = "Ana"
id_turma2 = 2
sql_insert_aluno2 = "INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma) VALUES (%s, NULL, %s)"
cursor.execute(sql_insert_aluno2, (nome_aluno2, id_turma2))

conexao.commit()

In [ ]:
# INSERINDO POR INPUT
df_turma = pd.read_sql_query('select * from turma', conexao)
print(df_turma.to_markdown(index = False))

nome_aluno = input("Digite o nome do aluno: ")
codigo_turma = int(input("Digite o ID da turma: "))

if codigo_turma not in df_turma['id_turma'].tolist():
    # Inserir aluno na tabela aluno sem turma associada
    sql_insert_aluno = "INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma) values (%s, NULL, NULL)"
    cursor.execute(sql_insert_aluno, (nome_aluno,))
    conexao.commit()
    print('\n ------------ ALUNO CADASTRADO COM SUCESSO ------------------------')
else:
    # Inserir aluno na tabela aluno com turma associada
    sql_insert_aluno = "INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma) values (%s, NULL, %s)"
    cursor.execute(sql_insert_aluno, (nome_aluno, codigo_turma))
    conexao.commit()
    print('\n ------------ ALUNO CADASTRADO COM SUCESSO ------------------------')

# MOSTRAR A TABELA ADICIONADA
sql_join = """
SELECT
    a.*,
    t.*
FROM
    aluno AS a
JOIN
    turma AS t ON a.id_turma = t.id_turma
"""

df_aluno_turma = pd.read_sql_query(sql_join, conexao)
print(df_aluno_turma.to_markdown(index = False))

c) Inserir pelo menos 2 alunos não alocados em nenhuma turma na tabela aluno (todos com NULL na coluna aluno_alocado);

In [ ]:
nome_aluno1 = "João"
sql_insert_aluno1 = "INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma) VALUES (%s, NULL, NULL)"
cursor.execute(sql_insert_aluno1, (nome_aluno1,))

nome_aluno2 = "Maria"
sql_insert_aluno2 = "INSERT INTO aluno (nome_aluno, aluno_alocado, id_turma) VALUES (%s, NULL, NULL)"
cursor.execute(sql_insert_aluno2, (nome_aluno2,))


conexao.commit()

d) Atualizar a coluna aluno_alocado da tabela aluno, de modo que os alunos associados a uma disciplina recebam o valor True e alunos não associdos a nenhuma disciplina recebam o falor False para esta coluna.

In [ ]:
# PARA ALUNOS JÁ CADASTRADOS E QUE FORAM INSERIDOS UM CODIGO DE TURMA ASSOCIADO
atualizar_tabelas_com_turma = """UPDATE aluno
SET aluno_alocado = 1
WHERE id_turma IS NOT NULL"""

cursor.execute(atualizar_tabelas_com_turma)
conexao.commit()

In [ ]:
# PARA ALUNOS JA CADASTRADOS QUE
atualizar_tabelas_sem_turma = """UPDATE aluno
SET aluno_alocado = 0
WHERE aluno_alocado IS NULL"""

cursor.execute(atualizar_tabelas_sem_turma)
conexao.commit()